; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob52) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate5)
	(at pallet1 distributor0)
	(clear crate9)
	(at pallet2 distributor1)
	(clear crate8)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 386)
	(at truck1 distributor1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 330)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 87)
	(at crate1 depot0)
	(on crate1 pallet0)
	(= (weight crate1) 81)
	(at crate2 distributor1)
	(on crate2 pallet2)
	(= (weight crate2) 22)
	(at crate3 distributor1)
	(on crate3 crate2)
	(= (weight crate3) 43)
	(at crate4 distributor0)
	(on crate4 crate0)
	(= (weight crate4) 16)
	(at crate5 depot0)
	(on crate5 crate1)
	(= (weight crate5) 95)
	(at crate6 distributor1)
	(on crate6 crate3)
	(= (weight crate6) 60)
	(at crate7 distributor0)
	(on crate7 crate4)
	(= (weight crate7) 51)
	(at crate8 distributor1)
	(on crate8 crate6)
	(= (weight crate8) 57)
	(at crate9 distributor0)
	(on crate9 crate7)
	(= (weight crate9) 32)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate9)
		(on crate1 crate3)
		(on crate2 crate1)
		(on crate3 crate6)
		(on crate4 crate5)
		(on crate5 crate7)
		(on crate6 pallet0)
		(on crate7 pallet2)
		(on crate9 crate4)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist2 crate8 crate6 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate6)
   added: (lifting hoist2 crate8) (clear crate6)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 9
2. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 57
   goals met: 0 of 9
3. (lift hoist0 crate5 crate1 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate1)
   added: (lifting hoist0 crate5) (clear crate1)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 9
4. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 2 to 12
   goals met: 0 of 9
5. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 95
   goals met: 0 of 9
6. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   changed: (fuel-cost) from 12 to 13
   goals met: 0 of 9
7. (lift hoist2 crate6 crate3 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate3)
   added: (lifting hoist2 crate6) (clear crate3)
   changed: (fuel-cost) from 13 to 14
   goals met: 0 of 9
8. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   changed: (current_load truck0) from 95 to 176
   goals met: 0 of 9
9. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 14 to 24
   goals met: 0 of 9
10. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 176 to 236
   goals met: 0 of 9
11. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 236 to 155
   goals met: 0 of 9
12. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 24 to 34
   goals met: 0 of 9
13. (lift hoist1 crate9 crate7 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate7)
   added: (lifting hoist1 crate9) (clear crate7)
   changed: (fuel-cost) from 34 to 35
   goals met: 0 of 9
14. (load hoist1 crate9 truck0 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   changed: (current_load truck0) from 155 to 187
   goals met: 0 of 9
15. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 187 to 92
   goals met: 0 of 9
16. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 35 to 45
   goals met: 0 of 9
17. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck0) from 92 to 32
   goals met: 0 of 9
18. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 45 to 55
   goals met: 0 of 9
19. (load hoist2 crate1 truck1 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   changed: (current_load truck1) from 57 to 138
   goals met: 0 of 9
20. (drop hoist0 crate6 pallet0 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 1 of 9
21. (lift hoist2 crate3 crate2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 crate2)
   added: (lifting hoist2 crate3) (clear crate2)
   changed: (fuel-cost) from 55 to 56
   goals met: 1 of 9
22. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   changed: (current_load truck1) from 138 to 181
   goals met: 1 of 9
23. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 56 to 66
   goals met: 1 of 9
24. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck1) from 181 to 138
   goals met: 1 of 9
25. (drop hoist0 crate3 crate6 depot0)
   deleted: (lifting hoist0 crate3) (clear crate6)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate6)
   goals met: 2 of 9
26. (unload hoist0 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck1) from 138 to 57
   goals met: 2 of 9
27. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 66 to 76
   goals met: 2 of 9
28. (drop hoist0 crate1 crate3 depot0)
   deleted: (lifting hoist0 crate1) (clear crate3)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate3)
   goals met: 3 of 9
29. (lift hoist2 crate2 pallet2 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   changed: (fuel-cost) from 76 to 77
   goals met: 3 of 9
30. (load hoist2 crate2 truck1 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   changed: (current_load truck1) from 57 to 79
   goals met: 3 of 9
31. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 77 to 87
   goals met: 3 of 9
32. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck1) from 79 to 57
   goals met: 3 of 9
33. (drop hoist0 crate2 crate1 depot0)
   deleted: (lifting hoist0 crate2) (clear crate1)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate1)
   goals met: 4 of 9
34. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 32 to 127
   goals met: 4 of 9
35. (lift hoist1 crate7 crate4 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate4)
   added: (lifting hoist1 crate7) (clear crate4)
   changed: (fuel-cost) from 87 to 88
   goals met: 4 of 9
36. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   changed: (current_load truck0) from 127 to 178
   goals met: 4 of 9
37. (unload hoist1 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck0) from 178 to 146
   goals met: 4 of 9
38. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 88 to 98
   goals met: 4 of 9
39. (unload hoist2 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck0) from 146 to 95
   goals met: 4 of 9
40. (drop hoist2 crate7 pallet2 distributor1)
   deleted: (lifting hoist2 crate7) (clear pallet2)
   added: (available hoist2) (at crate7 distributor1) (clear crate7) (on crate7 pallet2)
   goals met: 5 of 9
41. (unload hoist2 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist2)
   added: (lifting hoist2 crate5)
   changed: (current_load truck0) from 95 to 0
   goals met: 5 of 9
42. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 98 to 108
   goals met: 5 of 9
43. (load hoist1 crate9 truck0 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 32
   goals met: 5 of 9
44. (drop hoist2 crate5 crate7 distributor1)
   deleted: (lifting hoist2 crate5) (clear crate7)
   added: (available hoist2) (at crate5 distributor1) (clear crate5) (on crate5 crate7)
   goals met: 6 of 9
45. (lift hoist1 crate4 crate0 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate0)
   added: (lifting hoist1 crate4) (clear crate0)
   changed: (fuel-cost) from 108 to 109
   goals met: 6 of 9
46. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 32 to 48
   goals met: 6 of 9
47. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 109 to 119
   goals met: 6 of 9
48. (unload hoist2 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 48 to 32
   goals met: 6 of 9
49. (drop hoist2 crate4 crate5 distributor1)
   deleted: (lifting hoist2 crate4) (clear crate5)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 crate5)
   goals met: 7 of 9
50. (unload hoist2 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck0) from 32 to 0
   goals met: 7 of 9
51. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 119 to 129
   goals met: 7 of 9
52. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 129 to 130
   goals met: 7 of 9
53. (drop hoist2 crate9 crate4 distributor1)
   deleted: (lifting hoist2 crate9) (clear crate4)
   added: (available hoist2) (at crate9 distributor1) (clear crate9) (on crate9 crate4)
   goals met: 8 of 9
54. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 87
   goals met: 8 of 9
55. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 130 to 140
   goals met: 8 of 9
56. (unload hoist2 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck0) from 87 to 0
   goals met: 8 of 9
57. (drop hoist2 crate0 crate9 distributor1)
   deleted: (lifting hoist2 crate0) (clear crate9)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 crate9)
   goals met: 9 of 9
